In [11]:
# Data in a wrong format : to fix this problem there are two ways: removing the rows or convert all the cells in the same format
import pandas as pd
data=pd.read_csv('dirty_data.csv',encoding='latin1')
print(data.to_string())

       Name   Birthdate   Salary   Join Date
0     Alice  1990-01-01    50000  2010-01-15
1       Bob  1992-02-30    60000  2011-02-20
2   Charlie  1988/12/15    70000  2012/03/25
3     David  15-03-1991      NaN  2013-04-30
4       Eve  1995-07-25    80000         NaN
5     Frank  12/31/1993    45000  2015-06-10
6     Grace  1985-13-01    55000  2016-07-15
7    Hannah  1998-04-31    65000  2017-08-20
8       Ian  2000/11/23    75000     Invalid
9      Jack  1997-02-28    85000  2019-10-25
10     Kara  1996-05-05    50000  2020-11-30
11     Liam  1987/06/21  Invalid  2021-12-01
12     Mona  2001-09-12    68000         NaN
13     Nina  1999-12-99    62000  2022-02-29
14    Oscar  1989-02-29    72000  2018/01/10
15     Paul  1994-03-12    52000  2017-07-07
16    Quinn  1993-04-14    58000  2016-08-15
17   Rachel  1988/07/25    54000  2015/09/20
18    Steve  2002-08-32    56000  2014-10-10
19     Tina  2003/10/10    53000  2013-05-15

In [13]:
# Now we will convert all the data in the join date  column to date time format
import pandas as pd
data=pd.read_csv('dirty_data.csv')
data["Join Date"]=pd.to_datetime(data["Join Date"],errors="coerce")
# this errors="coerce" it converts all the values that cause errors int the tables to NaT(Not a Time) therefore making it easy for us to drop the values furthermore
print(data.to_string())

       Name   Birthdate   Salary  Join Date
0     Alice  1990-01-01    50000 2010-01-15
1       Bob  1992-02-30    60000 2011-02-20
2   Charlie  1988/12/15    70000        NaT
3     David  15-03-1991      NaN 2013-04-30
4       Eve  1995-07-25    80000        NaT
5     Frank  12/31/1993    45000 2015-06-10
6     Grace  1985-13-01    55000 2016-07-15
7    Hannah  1998-04-31    65000 2017-08-20
8       Ian  2000/11/23    75000        NaT
9      Jack  1997-02-28    85000 2019-10-25
10     Kara  1996-05-05    50000 2020-11-30
11     Liam  1987/06/21  Invalid 2021-12-01
12     Mona  2001-09-12    68000        NaT
13     Nina  1999-12-99    62000        NaT
14    Oscar  1989-02-29    72000        NaT
15     Paul  1994-03-12    52000 2017-07-07
16    Quinn  1993-04-14    58000 2016-08-15
17   Rachel  1988/07/25    54000        NaT
18    Steve  2002-08-32    56000 2014-10-10
19     Tina  2003/10/10    53000 2013-05-15

In [14]:
# Now we will remove the rows with a null value in the "Join Date" column
import pandas as pd
data=pd.read_csv('dirty_data.csv')
data["Join Date"]=pd.to_datetime(data["Join Date"],errors="coerce")
data.dropna(subset='Join Date',inplace=True)
print(data.to_string())

      Name   Birthdate   Salary  Join Date
0    Alice  1990-01-01    50000 2010-01-15
1      Bob  1992-02-30    60000 2011-02-20
3    David  15-03-1991      NaN 2013-04-30
5    Frank  12/31/1993    45000 2015-06-10
6    Grace  1985-13-01    55000 2016-07-15
7   Hannah  1998-04-31    65000 2017-08-20
9     Jack  1997-02-28    85000 2019-10-25
10    Kara  1996-05-05    50000 2020-11-30
11    Liam  1987/06/21  Invalid 2021-12-01
15    Paul  1994-03-12    52000 2017-07-07
16   Quinn  1993-04-14    58000 2016-08-15
18   Steve  2002-08-32    56000 2014-10-10
19    Tina  2003/10/10    53000 2013-05-15

In [18]:
# Now we will remove the rows with a null value in the "Birth Date" column
import pandas as pd
data=pd.read_csv('dirty_data.csv')
data["Birthdate"]=pd.to_datetime(data["Birthdate"],errors="coerce")
data.dropna(subset='Birthdate',inplace=True)
print(data.to_string())

     Name  Birthdate Salary   Join Date
0   Alice 1990-01-01  50000  2010-01-15
4     Eve 1995-07-25  80000         NaN
9    Jack 1997-02-28  85000  2019-10-25
10   Kara 1996-05-05  50000  2020-11-30
12   Mona 2001-09-12  68000         NaN
15   Paul 1994-03-12  52000  2017-07-07
16  Quinn 1993-04-14  58000  2016-08-15